snlkuharlocal/src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Чек</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Затраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЦБ</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдано</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРКО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопПроводки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкиЗатрат</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КапитальныеЗатраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>String</types>
      <types>CatalogRef.Контрагенты</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субзатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидыПодразделений/ВидыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодразделений</name>
  <enumValues>
    <name>Торговое</name>
  </enumValues>
  <enumValues>
    <name>Управляющее</name>
  </enumValues>
  <enumValues>
    <name>Сервисное</name>
  </enumValues>
  <enumValues>
    <name>Франчайзинг</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийРКО/ВидыОперацийРКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРКО</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОплатаПоставщику</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлаты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ИнкассацияДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РасходДенежныхСредствПрочее</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаУслуг</name>
  </enumValues>
  <enumValues>
    <name>АвансовыйОтчет</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОстаткаПодарочногоСертификата</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПодарочногоСертификата</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/РасходныйКассовыйОрдер/ObjectModule.bsl
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14
Функция РаспределитьЗатраты(Знач СуммаКРаспределению)	
	БР=Новый ТаблицаЗначений; //база распределения
	БР.Колонки.Добавить("СтатьяДДС");
	БР.Колонки.Добавить("Подразделение");
	БР.Колонки.Добавить("КапитальныеЗатраты");
	БР.Колонки.Добавить("ПериодРасходов");	
	БР.Колонки.Добавить("Проект");	
	БР.Колонки.Добавить("СубЗатрата");
	БР.Колонки.Добавить("База",ПолучитьОписаниеТиповЧисла(19,2));
	БР.Колонки.Добавить("Сумма",ПолучитьОписаниеТиповЧисла(19,2));
	
	
	Если РасшифровкиЗатрат.Количество()=0 Тогда
		СтрокаБР=БР.Добавить();
		
		СтрокаБР.СтатьяДДС			=СтатьяДДС;
		СтрокаБР.Подразделение		=Подразделение;
		СтрокаБР.КапитальныеЗатраты	=КапитальныеЗатраты;
		СтрокаБР.ПериодРасходов		=НачалоМесяца(?(ЗначениеЗаполнено(ПериодРасходов),ПериодРасходов,Дата));
		СтрокаБР.Проект				=Проект;
		СтрокаБР.СубЗатрата			=СубЗатрата;		
		
		СтрокаБР.База			=СуммаКРаспределению;
		СтрокаБР.Сумма			=СуммаКРаспределению;
	Иначе
		Для Каждого СтрокаР Из РасшифровкиЗатрат Цикл
			СтрокаБР=БР.Добавить();		
			
			СтрокаБР.СтатьяДДС		= ?(ЗначениеЗаполнено(СтрокаР.СтатьяДДС)	,СтрокаР.СтатьяДДС		,СтатьяДДС);
			СтрокаБР.Подразделение	= ?(ЗначениеЗаполнено(СтрокаР.Подразделение),СтрокаР.Подразделение	,Подразделение);		
			СтрокаБР.КапитальныеЗатраты	= ?(ЗначениеЗаполнено(СтрокаР.КапитальныеЗатраты),	СтрокаР.КапитальныеЗатраты	,КапитальныеЗатраты);
			СтрокаБР.Проект				= ?(ЗначениеЗаполнено(СтрокаР.Проект),				СтрокаР.Проект				,Проект);
			СтрокаБР.СубЗатрата			= ?(ЗначениеЗаполнено(СтрокаР.СубЗатрата),			СтрокаР.СубЗатрата			,СубЗатрата);
			
			Если ЗначениеЗаполнено(СтрокаР.ПериодРасходов) Тогда
				СтрокаБР.ПериодРасходов		= НачалоМесяца(СтрокаР.ПериодРасходов);
			ИначеЕсли ЗначениеЗаполнено(ПериодРасходов) Тогда
				СтрокаБР.ПериодРасходов		= НачалоМесяца(ПериодРасходов);
			Иначе
				СтрокаБР.ПериодРасходов		= НачалоМесяца(Дата);
			КонецЕсли;			
			
			СтрокаБР.База			= СтрокаР.Сумма;			
		КонецЦикла;
		
		МаксСтрокаБР	=Неопределено;
		МаксСумма		=-100000000000000000000000000;
		
		БазаВсего=БР.Итог("База");
		
		Если БазаВсего=0 Тогда
			СообщитьОбОшибке("Нулевая база распределения расходов !!!");
			
			БР.ЗаполнитьЗначения(1,"База");
			БазаВсего=БР.Итог("База");
		КонецЕсли; 
		
		Для Каждого СтрокаБР Из БР Цикл		
			СтрокаБР.Сумма=СуммаКРаспределению*СтрокаБР.База/БазаВсего;
			
			Если Модуль(СтрокаБР.Сумма)>МаксСумма Тогда
				МаксСумма	=Модуль(СтрокаБР.Сумма);
				МаксСтрокаБР=СтрокаБР;			
			КонецЕсли; 
		КонецЦикла; 
		
		Если БР.Итог("Сумма")<>СуммаКРаспределению И МаксСтрокаБР<>Неопределено Тогда
			МаксСтрокаБР.Сумма=МаксСтрокаБР.Сумма+(СуммаКРаспределению-БР.Итог("Сумма"));
		КонецЕсли; 
	КонецЕсли;	
	
	Возврат БР;
КонецФункции //ПолучитьЗатраты(СтрокаТЧ)

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//+++Чирков 18.03.13 
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда Возврат КонецЕсли; 
	//---Чирков 18.03.13
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ВалютаУпр			=ПараметрыСеанса.ВалютаУпр_2009;	
	ВалютаРасчетов		=ПолучитьВалютуРасчетов(Договор);
	
	Ошибки="";
	
	КурсУпр				=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,	Дата);
	КурсВалютыДокумента	=ПолучитьКурсВалюты_ПоРусски(Валюта,	Дата);
	
	СуммаУпр			=глПересчет(Сумма,Валюта,КурсВалютыДокумента,ВалютаУпр,КурсУпр);
	КурсоваяРазница		=0;
	
	Если Затраты Тогда //ЗАТРАТЫ		
		Если НЕ ПустаяСтрока(Ошибки) Тогда			
			Сообщить(Ошибки,СтатусСообщения.Важное);				
		КонецЕсли; 
		
		БР=РаспределитьЗатраты(Сумма);
		
		Для Каждого СтрокаБР Из БР Цикл
			СуммаДок 					= СтрокаБР.Сумма;
			
			Если СуммаДок=0 Тогда Продолжить КонецЕсли; 
			
			Движение 					= Движения.Затраты.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;	
			
			Движение.Период				= Дата;
			
			Движение.Подразделение		= СтрокаБР.Подразделение;
			Движение.СтатьяЗатрат		= СтрокаБР.СтатьяДДС;			
			Движение.СубЗатрата			= СтрокаБР.СубЗатрата;
			
			Движение.СуммаУпр			= Модуль(глПересчет(СуммаДок,Валюта,КурсВалютыДокумента,ВалютаУпр,КурсУпр));			
			
			Движение.Контрагент			= Контрагент;
			Движение.Договор			= Договор;
			
			Движение.КапитальныеЗатраты	= СтрокаБР.КапитальныеЗатраты;
			Движение.ПериодРасходов		= СтрокаБР.ПериодРасходов;
			Движение.Проект				= СтрокаБР.Проект;
			
			Движение.СуммаДокумента		= СуммаДок;
			Движение.ВалютаДокумента	= Валюта;	
			//крохин начало
			Движение.Комментарий        = Комментарий;
			//крохин конец
			
			
			Движение.ДатаЗаписи			= ТекущаяДата();
		КонецЦикла;
	Иначе //ВЗАИМОРАСЧЕТЫ
		Если Контрагент.Пустая() Тогда
			Ошибки=Ошибки+"Не указан контрагент !";											
		КонецЕсли; 
		
		Если НЕ ПустаяСтрока(Ошибки) Тогда			
			Сообщить(Ошибки,СтатусСообщения.Важное);				
		КонецЕсли;
		
		Движение 					= Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
		
		Движение.Период				= Дата;
		Движение.Контрагент			= ?(ЗначениеЗаполнено(КонтрагентЦБ),КонтрагентЦБ,Контрагент);
		Движение.Договор 			= Договор;			
		
		Движение.СуммаВал			= Модуль(глПересчет(Сумма,Валюта,Курс,ВалютаРасчетов,Дата));
		Движение.СуммаУпр			= Модуль(глПересчет(Сумма,Валюта,Курс,ВалютаУпр,КурсУпр));
		
		Движение.СуммаДокумента		= Сумма;
		Движение.ВалютаДокумента	= Валюта;	
		Движение.СтатьяДДС			= СтатьяДДС;			
		
		Если ДокОснование<>Неопределено И ЕстьРеквизитДокумента("КодОперации",ДокОснование.Метаданные()) Тогда
			Движение.КодОперации=ДокОснование.КодОперации;			
		КонецЕсли;		
		
		//крохин начало 30.01.2017
		//для возвратов сдачи по подарочным сертификатам добавляются 2 проводки
		Если ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратОстаткаПодарочногоСертификата Тогда
		//обратная проводка по частному лицу	
			Движение 					= Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
		
		Движение.Период				= Дата;
		Движение.Контрагент			= ?(ЗначениеЗаполнено(КонтрагентЦБ),КонтрагентЦБ,Контрагент);
		Движение.Договор 			= Договор;			
		
		Движение.СуммаВал			= Модуль(глПересчет(Сумма,Валюта,Курс,ВалютаРасчетов,Дата));
		Движение.СуммаУпр			= Модуль(глПересчет(Сумма,Валюта,Курс,ВалютаУпр,КурсУпр));
		
		Движение.СуммаДокумента		= Сумма;
		Движение.ВалютаДокумента	= Валюта;	
		Движение.СтатьяДДС			= СтатьяДДС;
		//проводка по "сертификаты проданные"
			Движение 					= Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
		
		Движение.Период				= Дата;
		ТекКонтрагент = Справочники.Контрагенты.НайтиПоКоду("SMN-7258");
		Движение.Контрагент			= ТекКонтрагент;//?(ЗначениеЗаполнено(КонтрагентЦБ),КонтрагентЦБ,Контрагент);
		Движение.Договор 			= ТекКонтрагент.ОсновнойДоговор;//Договор;			
		
		Движение.СуммаВал			= Модуль(глПересчет(Сумма,Валюта,Курс,ВалютаРасчетов,Дата));
		Движение.СуммаУпр			= Модуль(глПересчет(Сумма,Валюта,Курс,ВалютаУпр,КурсУпр));
		
		Движение.СуммаДокумента		= Сумма;
		Движение.ВалютаДокумента	= Валюта;	
		Движение.СтатьяДДС			= СтатьяДДС;
		КонецЕсли;
		//крохин конец 30.01.2017
		
		КурсоваяРазница=СуммаУпр-Движение.СуммаУпр;
		Если КурсоваяРазница<>0 Тогда
			Движение 					= Движения.Затраты.Добавить();
			
			Движение.ВидДвижения		= ?(КурсоваяРазница>0,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);	
			
			Движение.Период				= Дата;
			
			Движение.Подразделение		= Подразделение;
			Движение.СтатьяЗатрат		= Справочники.СтатьиЗатрат.КурсовыеРазницы;			
			
			Движение.СуммаУпр			= Модуль(КурсоваяРазница);			
			
			Движение.Контрагент			= Контрагент;
			
			Движение.Договор			= Договор;
			
			Движение.СуммаДокумента		= 0;
			Движение.ВалютаДокумента	= Валюта;	
			
			//крохин начало
			Движение.Комментарий        = "Курсовая разница";
			//крохин конец
			
			
			Движение.ДатаЗаписи			= ТекущаяДата();					
		КонецЕсли; 
	КонецЕсли;		
	
	//ДЕНЕЖНЫЕ СРЕДСТВА
	БР=РаспределитьЗатраты(Сумма);		
	Для Каждого СтрокаБР Из БР Цикл
		СуммаДок 					= СтрокаБР.Сумма;
		
		Движение					= Движения.ДенежныеСредства.Добавить();
		
		Движение.Период				= Дата;
		Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;			
		Движение.БанковскийСчет		= Касса;			
		Движение.Валюта				= Валюта;
		
		Движение.Сумма				= СуммаДок;
		Если Дата>='20090101' Тогда
			Движение.СуммаУпр		= глПересчет(СуммаДок,Валюта,КурсВалютыДокумента,ВалютаУпр,КурсУпр);		
		КонецЕсли;
		
		Движение.СтатьяДДС			= СтрокаБР.СтатьяДДС;
		//+HELP-2684 20250204 Михайловский
		Если ЗначениеЗаполнено(Касса.ПодразделениеДляУчета) И (Дата>='20241201')  Тогда
			Движение.Подразделение	= Касса.ПодразделениеДляУчета;
		Иначе
			Движение.Подразделение		= СтрокаБР.Подразделение;
		КонецЕсли;
		//-HELP-2684 20250204 Михайловский
		Движение.ПериодРасходов		= СтрокаБР.ПериодРасходов;		
		Движение.Проект				= СтрокаБР.Проект;
		
		//крохин начало 14.08.2013
		//Движение.Отправитель		= КонтрагентЦБ;
		Если Дата >= '20130801' Тогда
			Движение.Отправитель		= ?(КонтрагентЦБ.Пустая(),Контрагент,КонтрагентЦБ);	
		Иначе
			Движение.Отправитель		= КонтрагентЦБ;	
		КонецЕсли;
		//крохин конец 14.08.2013
		Движение.Договор			= Договор;	
		//крохин начало
		Движение.Комментарий        = Комментарий;
		Если Дата > '20100901' Тогда
			Движение.Субзатрата         = СтрокаБР.СубЗатрата;
		КонецЕсли;
		//крохин конец
		
		
		Движение.СуммаДокумента		= СуммаДок;
		Движение.ВалютаДокумента	= Валюта;
	КонецЦикла;	
	
	Если ОбменДанными.Загрузка Тогда
		Движения.Взаиморасчеты.Записать();
		Движения.Затраты.Записать();
		Движения.ДенежныеСредства.Записать();	
	КонецЕсли;
КонецПроцедуры

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);		
		//кухарь 19.11.14 начало
		//запрет проведения РКО задним числом
		//кухарь 23.12.14 начало
		//если НачалоДня(Дата)<НачалоДня(ТекущаяДата()) и не РольДоступна("Администратор") тогда
		//кухарь 12.01.15 начало
		//оставляем только для филиалов
		//если НачалоДня(Дата)<НачалоДня(ТекущаяДата()) и не РольДоступна("Администратор") и ПараметрыСеанса.ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда 
		//крохин начало 07.07.2015
		//для семеновского открываем
		//если НачалоДня(Дата)<НачалоДня(ТекущаяДата()) и не РольДоступна("Администратор") и ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение и ПараметрыСеанса.ЭтотУзел.Подразделение.ЕстьВыделенныйСклад  Тогда 
		//крохин начало 27.07.2016
		//снова всем разрешаем
		//если НачалоДня(Дата)<НачалоДня(ТекущаяДата()) и не РольДоступна("Администратор") и ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение и ПараметрыСеанса.ЭтотУзел.Подразделение.ЕстьВыделенныйСклад И НЕ ПараметрыСеанса.ЭтотУзел.Код = "SEM" Тогда 
		Если Ложь Тогда
			//крохин конец 27.07.2016	
			//крохин конец 07.07.2015 
			//кухарь 12.01.15 конец
			//кухарь 23.12.14 конец	
			#Если клиент тогда
				//крохин начало 07.07.2015
				//Сообщить("Проведение кассовых документов задним число - запрещено!");
				Сообщить("Проведение кассовых документов задним числом запрещено!");
				//крохин конец 07.07.2015	
				Отказ=Истина;
			#КонецЕсли
		КонецЕсли;
		//кухарь 19.11.14 конец			
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	//Если ЕстьИзменения Тогда
	//	ИтогоПриход=Платежи.Итог("Приход");
	//	ИтогоРасход=Платежи.Итог("Расход");	
	//КонецЕсли; 
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
	//+HELP-2684 20250204 Михайловский
	Если ЗначениеЗаполнено(Касса.ПодразделениеДляУчета) И (Дата>='20241201') И НЕ (Подразделение	= Касса.ПодразделениеДляУчета)  Тогда
		Подразделение	= Касса.ПодразделениеДляУчета;
	КонецЕсли;
	//-HELP-2684 20250204 Михайловский
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ДокОснование		= Основание;
		
		ИБ 					= Основание.ИБ;
		Организация 		= Основание.Организация;
		Подразделение		= Основание.Склад.Подразделение;
		
		Контрагент 			= Основание.Контрагент;
		КонтрагентЦБ		= Контрагент.Ведущий;
		Договор 			= Основание.Договор;		
		
		Сумма 				= Основание.СуммаДокумента;
		//кухарь 23.01.15 начало
		//учтём оплату баллами
		Сумма=сумма-Основание.СуммаБалловКВозвратуНаКарту;
		//кухарь 23.01.15 конец
		Валюта 				= Основание.Валюта;
		
		СтатьяДДС			= Справочники.СтатьиЗатрат.НайтиПоНаименованию("Приход от покупателей");
		
		Комментарий 		= "На основании: "+Основание;	
		
		// Нечаева 30.03.2010 11:54:10  +++		
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			ВидОперации=Перечисления.ВидыОперацийРКО.ОплатаПоставщику;
			СтатьяДДС = Справочники.СтатьиЗатрат.НайтиПоКоду("211 100"); //выручка
			//Кухарь 22.08.16 начало
			//Подразделение = ПараметрыСеанса.Пользователь.ФизЛицо.Подразделение;
			Подразделение = ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделение"); 
			//Кухарь 22.08.16 конец
			
			Касса = Подразделение.Сейф;
			Контрагент = Неопределено;
			//крохин начало 05.02.2014
			Договор = Неопределено;
			//крохин конец 05.02.2014
			Затраты=Ложь;
			
			//крохин начало 31.01.2017
			//возврат ПС
			Если Основание.ВозвратПСотЧЛ Тогда
				ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратПодарочногоСертификата;	
			КонецЕсли;
			//крохин конец 31.01.2017
			
		Конецесли;
		
		// Нечаева  30.03.2010 11:54:14 ---
		//крохин начало
		Если Дата > '20100601' И Контрагент <> Справочники.Контрагенты.ПустаяСсылка() И Контрагент.родитель <> Подразделение.ЧастноеЛицо.Родитель Тогда
			ДопПроводки = Истина;	
		Иначе
			ДопПроводки = Ложь;
		КонецЕсли;
		//крохин конец
		
		//крохин начало 30.01.2017
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.Чек") Тогда	
		//крохин начало 30.01.2018
		//сдача ПС по чеку возможна только день в день
		//крохин начало 13.06.2018
		//опечатка
		//Если НачалоДня(Основание) <> НачалоДня(ТекущаяДата()) Тогда
		Если НачалоДня(Основание.Дата) <> НачалоДня(ТекущаяДата()) Тогда
			//крохин конец 13.06.2018	
			Сообщить("возврат сдачи при оплате подарочным сертификатом возможен только за текущий день!");
			Возврат;
		КонецЕсли;
		//крохин конец 30.01.2018
		ДокОснование		= Основание;
		Если ДокОснование.ПодарочныеСертификаты.Количество() > 0 Тогда
			ЭтоПодарок = Истина;
			Для Каждого строкаТЧ из ДокОснование.ПодарочныеСертификаты Цикл
				Если строкаТЧ.Подарок Тогда
					ЭтоПодарок = Истина;
				Иначе
					ЭтоПодарок = Ложь;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ЭтоПодарок Тогда
				ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратОстаткаПодарочногоСертификата;
				Сумма = ДокОснование.ПодарочныеСертификаты.Итог("Номинал") - ДокОснование.Товары.Итог("Всего");
				Комментарий = "Возврат неизрасходованных денежных средств при отоваривании подарочного сертификата. Чек продажи: "+ДокОснование.Номер + " от "+ Формат(ДокОснование.Дата,"ДФ=dd.MM.yyyy");
				Контрагент = ДокОснование.Контрагент;
				КонтрагентЦБ = Контрагент.Ведущий;
				Договор = Контрагент.ОсновнойДоговор;
				СтатьяДДС = Справочники.СтатьиЗатрат.Выручка;
				Подразделение = ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделение");
				Касса = Подразделение.Сейф;
				Затраты = Ложь;
			Иначе
				Сообщить("оплата произведена с помощью сертификатов-подарков. Оформление РКО на сдачу невозможно!");
				Возврат;
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;	
	//крохин конец 30.01.2017	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор   = Неопределено;
	Курс	= 0;
	Дата	= Неопределено;	
	РасшифровкиЗатрат.Очистить();
	//крохин начало 14.06.2011
	Выдано = "";
	ПоДокументу = "";
	//крохин конец 14.06.2011
	
	//крохин начало 07.03.2012
	ДокОснование = Неопределено;
	//крохин конец 07.03.2012
	//крохин начало 05.02.2014
	Если ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты") Тогда
		КонтрагентЦБ=Контрагент.Ведущий;	
		Если Договор.КодЦБ<>Контрагент.КодЦБ Тогда
			//	Сообщить("не совпадет договор и контрагент");
			Договор=Неопределено;			
		КонецЕсли; 	
	ИначеЕсли ТипЗнч(Контрагент)=Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Если Договор.Владелец <> Контрагент Тогда
			//	Сообщить("не совпадет договор и контрагент");
			Договор=Неопределено;	
		КонецЕсли;
	КонецЕсли;
	
	//крохин конец 05.02.2014	
	
	//нечаева 20,08,14 +++ начало
	Если договор.НеИспользовать Тогда
		//Предупреждение("Договор не предназначен для использования в документах");
		договор = Неопределено;
	КонецЕсли;
	//нечаева 20,08,14 конец
	
	
	
КонецПроцедуры

//Катаев+ 08/10/14
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
//Катаев- 08/10/14
